CFXS/CFXS-Motion-Controller/CFXS_Motion_Controller/src/lwip/tiva-tm4c129.cpp
            /* No pbuf available so leave the buffer pointer empty. */
            g_pRxDescriptors[ui32Loop].Desc.pvBuffer1      = 0;
            g_pRxDescriptors[ui32Loop].Desc.ui32CtrlStatus = 0;
        }
        g_pRxDescriptors[ui32Loop].Desc.DES3.pLink =
            ((ui32Loop == (NUM_RX_DESCRIPTORS - 1)) ? &g_pRxDescriptors[0].Desc : &g_pRxDescriptors[ui32Loop + 1].Desc);
    }

    g_TxDescList.ui32Read  = 0;
    g_TxDescList.ui32Write = 0;

    //
    // Set the descriptor pointers in the hardware.
    //
    EMACRxDMADescriptorListSet(EMAC0_BASE, &g_pRxDescriptors[0].Desc);
    EMACTxDMADescriptorListSet(EMAC0_BASE, &g_pTxDescriptors[0].Desc);
}

/**
 * In this function, the hardware should be initialized.
 * Called from tivaif_init().
 *
 * @param netif the already initialized lwip network interface structure
 *        for this ethernetif
 */
static void tivaif_hwinit(struct netif *psNetif) {
    uint16_t ui16Val;

    /* clear the EEE Link Active flag */
#if EEE_SUPPORT
    g_bEEELinkActive = false;
#endif

    /* Set MAC hardware address length */
    psNetif->hwaddr_len = ETHARP_HWADDR_LEN;

    /* Set MAC hardware address */
    EMACAddrGet(EMAC0_BASE, 0, &(psNetif->hwaddr[0]));

    /* Maximum transfer unit */
    psNetif->mtu = 1500;

    /* Device capabilities */
    psNetif->flags = NETIF_FLAG_BROADCAST | NETIF_FLAG_ETHARP | NETIF_FLAG_ETHERNET | NETIF_FLAG_LINK_UP |
                     NETIF_FLAG_IGMP; //NAFTDO: IGMP NEVER WORKED BECAUSE THE FLAG WAS NEVER SET LMAO - KRISTS

    /* Initialize the DMA descriptors. */
    InitDMADescriptors();

#if defined(EMAC_PHY_IS_EXT_MII) || defined(EMAC_PHY_IS_EXT_RMII)
    /* If PHY is external then reset the PHY before configuring it */
    EMACPHYWrite(EMAC0_BASE, PHY_PHYS_ADDR, EPHY_BMCR, EPHY_BMCR_MIIRESET);

    while ((EMACPHYRead(EMAC0_BASE, PHY_PHYS_ADDR, EPHY_BMCR) & EPHY_BMCR_MIIRESET) == EPHY_BMCR_MIIRESET)
        ;
#endif

    /* Clear any stray PHY interrupts that may be set. */
    ui16Val = EMACPHYRead(EMAC0_BASE, PHY_PHYS_ADDR, EPHY_MISR1);
    ui16Val = EMACPHYRead(EMAC0_BASE, PHY_PHYS_ADDR, EPHY_MISR2);

    /* Configure and enable the link status change interrupt in the PHY. */
    ui16Val = EMACPHYRead(EMAC0_BASE, PHY_PHYS_ADDR, EPHY_SCR);
    ui16Val |= (EPHY_SCR_INTEN_EXT | EPHY_SCR_INTOE_EXT);
    EMACPHYWrite(EMAC0_BASE, PHY_PHYS_ADDR, EPHY_SCR, ui16Val);
    EMACPHYWrite(
        EMAC0_BASE, PHY_PHYS_ADDR, EPHY_MISR1, (EPHY_MISR1_LINKSTATEN | EPHY_MISR1_SPEEDEN | EPHY_MISR1_DUPLEXMEN | EPHY_MISR1_ANCEN));

    /* Read the PHY interrupt status to clear any stray events. */
    ui16Val = EMACPHYRead(EMAC0_BASE, PHY_PHYS_ADDR, EPHY_MISR1);

    /**
   * Set MAC filtering options.  We receive all broadcast and mui32ticast
   * packets along with those addressed specifically for us.
   */
    EMACFrameFilterSet(EMAC0_BASE, (EMAC_FRMFILTER_HASH_AND_PERFECT | EMAC_FRMFILTER_PASS_MULTICAST));

#if LWIP_PTPD
    //
    // Enable timestamping on all received packets.
    //
    // We set the fine clock adjustment mode and configure the subsecond
    // increment to half the 25MHz PTPD clock.  This will give us maximum control
    // over the clock rate adjustment and keep the arithmetic easy later.  It
    // should be possible to synchronize with higher accuracy than this with
    // appropriate juggling of the subsecond increment count and the addend
    // register value, though.
    //
    EMACTimestampConfigSet(EMAC0_BASE,
                           (EMAC_TS_ALL_RX_FRAMES | EMAC_TS_DIGITAL_ROLLOVER | EMAC_TS_PROCESS_IPV4_UDP | EMAC_TS_ALL |
                            EMAC_TS_PTP_VERSION_1 | EMAC_TS_UPDATE_FINE),
                           (1000000000 / (25000000 / 2)));
    EMACTimestampAddendSet(EMAC0_BASE, 0x80000000);
    EMACTimestampEnable(EMAC0_BASE);
#endif

    /* Clear any pending MAC interrupts. */
    EMACIntClear(EMAC0_BASE, EMACIntStatus(EMAC0_BASE, false));

    /* Enable the Ethernet MAC transmitter and receiver. */
    EMACTxEnable(EMAC0_BASE);
    EMACRxEnable(EMAC0_BASE);

    /* Enable the Ethernet RX and TX interrupt source. */
    EMACIntEnable(
        EMAC0_BASE,
        (EMAC_INT_RECEIVE | EMAC_INT_TRANSMIT | EMAC_INT_TX_STOPPED | EMAC_INT_RX_NO_BUFFER | EMAC_INT_RX_STOPPED | EMAC_INT_PHY));

    /* Enable the Ethernet interrupt. */
    IntEnable(INT_EMAC0);

    /* Enable all processor interrupts. */
    //IntMasterEnable(); //TODO(KRISTS): MODOFIED BY ME because wtf does lwip have to do with interrupts?

    /* Tell the PHY to start an auto-negotiation cycle. */
#if defined(EMAC_PHY_IS_EXT_MII) || defined(EMAC_PHY_IS_EXT_RMII)
    EMACPHYWrite(EMAC0_BASE, PHY_PHYS_ADDR, EPHY_BMCR, (EPHY_BMCR_SPEED | EPHY_BMCR_DUPLEXM | EPHY_BMCR_ANEN | EPHY_BMCR_RESTARTAN));
#else
    EMACPHYWrite(EMAC0_BASE, PHY_PHYS_ADDR, EPHY_BMCR, (EPHY_BMCR_ANEN | EPHY_BMCR_RESTARTAN));
#endif
}

#ifdef DEBUG
/**
 * Dump the chain of pbuf pointers to the debug output.
 */
void tivaif_trace_pbuf(const char *pcTitle, struct pbuf *p) {
    //LWIP_DEBUGF(NETIF_DEBUG, ("%s %08x (%d, %d)", pcTitle, p, p->tot_len, p->len));

    do {
        p = p->next;
        if (p) {
            //LWIP_DEBUGF(NETIF_DEBUG, ("->%08x(%d)", p, p->len));
        } else {
            //LWIP_DEBUGF(NETIF_DEBUG, ("->%08x", p));
        }

    } while ((p != NULL) && (p->tot_len != p->len));

    //LWIP_DEBUGF(NETIF_DEBUG, ("\n"));
}
#endif

/**
 * This function is used to check whether a passed pbuf contains only buffers
 * resident in regions of memory that the Ethernet MAC can access.  If any
 * buffers in the chain are outside a directly-DMAable section of memory,
 * the pbuf is copied to SRAM and a different pointer returned.  If all
 * buffers are safe, the pbuf reference count is incremented and the original
 * pointer returned.
 */
static struct pbuf *tivaif_check_pbuf(struct pbuf *p) {
    struct pbuf *pBuf;
    err_t Err;

    pBuf = p;

#ifdef DEBUG
    tivaif_trace_pbuf("Original:", p);
#endif

    /* Walk the list of buffers in the pbuf checking each. */
    do {
        /* Does this pbuf's payload reside in memory that the Ethernet DMA
         * can access?
         */
        if (!PTR_SAFE_FOR_EMAC_DMA(pBuf->payload)) {
            /* This buffer is outside the DMA-able memory space so we need
             * to copy the pbuf.
             */
            pBuf = pbuf_alloc(PBUF_RAW, p->tot_len, PBUF_POOL);

            /* If we got a new pbuf... */
            if (pBuf) {
                /* ...copy the old pbuf into the new one. */
                Err = pbuf_copy(pBuf, p);

                /* If we failed to copy the pbuf, free the newly allocated one
                 * and make sure we return a NULL to show a problem.
                 */
                if (Err != ERR_OK) {
                    DRIVER_STATS_INC(TXCopyFailCount);
                    pbuf_free(pBuf);
                    pBuf = NULL;
                } else {
#ifdef DEBUG
                    tivaif_trace_pbuf("Copied:", pBuf);
#endif
                    DRIVER_STATS_INC(TXCopyCount);
                }
            }

            /* Reduce the reference count on the original pbuf since we're not
             * going to hold on to it after returning from tivaif_transmit.
             * Note that we already bumped the reference count at the top of
             * tivaif_transmit.
             */
            pbuf_free(p);

