CFXS/CFXS-Motion-Controller/CFXS_Motion_Controller/src/lwip/tiva-tm4c129.cpp
    return (ERR_OK);
}

/**
 * This function will process all transmit descriptors and free pbufs attached
 * to any that have been transmitted since we last checked.
 *
 * This function is called only from the Ethernet interrupt handler.
 *
 * @param netif the lwip network interface structure for this ethernetif
 * @return None.
 */
static void tivaif_process_transmit(tStellarisIF *pIF) {
    tDescriptorList *pDescList;
    uint32_t ui32NumDescs;

    /* Get a pointer to the transmit descriptor list. */
    pDescList = pIF->pTxDescList;

    /* Walk the list until we have checked all descriptors or we reach the
     * write pointer or find a descriptor that the hardware is still working
     * on.
     */
    for (ui32NumDescs = 0; ui32NumDescs < pDescList->ui32NumDescs; ui32NumDescs++) {
        /* Has the buffer attached to this descriptor been transmitted? */
        if (pDescList->pDescriptors[pDescList->ui32Read].Desc.ui32CtrlStatus & DES0_TX_CTRL_OWN) {
            /* No - we're finished. */
            break;
        }

        /* Does this descriptor have a buffer attached to it? */
        if (pDescList->pDescriptors[pDescList->ui32Read].pBuf) {
            /* Yes - free it if it's not marked as an intermediate pbuf */
            if (!((uint32_t)(pDescList->pDescriptors[pDescList->ui32Read].pBuf) & 1)) {
                pbuf_free(pDescList->pDescriptors[pDescList->ui32Read].pBuf);
                DRIVER_STATS_INC(TXBufFreedCount);
            }
            pDescList->pDescriptors[pDescList->ui32Read].pBuf = NULL;
        } else {
            /* If the descriptor has no buffer, we are finished. */
            break;
        }

        /* Move on to the next descriptor. */
        pDescList->ui32Read++;
        if (pDescList->ui32Read == pDescList->ui32NumDescs) {
            pDescList->ui32Read = 0;
        }
    }
}

/**
 * This function will process all receive descriptors that contain newly read
 * data and pass complete frames up the lwIP stack as they are found.  The
 * timestamp of the packet will be placed into the pbuf structure if PTPD is
 * enabled.
 *
 * This function is called only from the Ethernet interrupt handler.
 *
 * @param psNetif the lwip network interface structure for this ethernetif
 * @return None.
 */
static void tivaif_receive(struct netif *psNetif) {
    tDescriptorList *pDescList;
    tStellarisIF *pIF;
    static struct pbuf *pBuf = NULL;
    uint32_t ui32DescEnd;

    /* Get a pointer to our state data */
    pIF = (tStellarisIF *)(psNetif->state);

    /* Get a pointer to the receive descriptor list. */
    pDescList = pIF->pRxDescList;

    /* Start with a NULL pbuf so that we don't try to link chain the first
   * time round.
   */
    //pBuf = NULL;

    /* Determine where we start and end our walk of the descriptor list */
    ui32DescEnd = pDescList->ui32Read ? (pDescList->ui32Read - 1) : (pDescList->ui32NumDescs - 1);

    /* Step through the descriptors that are marked for CPU attention. */
    while (pDescList->ui32Read != ui32DescEnd) {
        /* Does the current descriptor have a buffer attached to it? */
        if (pDescList->pDescriptors[pDescList->ui32Read].pBuf) {
            /* Yes - determine if the host has filled it yet. */
            if (pDescList->pDescriptors[pDescList->ui32Read].Desc.ui32CtrlStatus & DES0_RX_CTRL_OWN) {
                /* The DMA engine still owns the descriptor so we are finished */
                break;
            }

            DRIVER_STATS_INC(RXBufReadCount);

            /* If this descriptor contains the end of the packet, fix up the
           * buffer size accordingly.
           */
            if (pDescList->pDescriptors[pDescList->ui32Read].Desc.ui32CtrlStatus & DES0_RX_STAT_LAST_DESC) {
                /* This is the last descriptor for the frame so fix up the
               * length.  It is safe for us to modify the internal fields
               * directly here (rather than calling pbuf_realloc) since we
               * know each of these pbufs is never chained.
               */
                pDescList->pDescriptors[pDescList->ui32Read].pBuf->len =
                    (pDescList->pDescriptors[pDescList->ui32Read].Desc.ui32CtrlStatus & DES0_RX_STAT_FRAME_LENGTH_M) >>
                    DES0_RX_STAT_FRAME_LENGTH_S;
                pDescList->pDescriptors[pDescList->ui32Read].pBuf->tot_len = pDescList->pDescriptors[pDescList->ui32Read].pBuf->len;
            }

            if (pBuf) {
                /* Link this pbuf to the last one we looked at since this buffer
               * is a continuation of an existing frame (split across multiple
               * pbufs).  Note that we use pbuf_cat() here rather than
               * pbuf_chain() since we don't want to increase the reference
               * count of either pbuf - we only want to link them together.
               */
                pbuf_cat(pBuf, pDescList->pDescriptors[pDescList->ui32Read].pBuf);
                pDescList->pDescriptors[pDescList->ui32Read].pBuf = pBuf;
            }

            /* Remember the buffer associated with this descriptor. */
            pBuf = pDescList->pDescriptors[pDescList->ui32Read].pBuf;

            /* Is this the last descriptor for the current frame? */
            if (pDescList->pDescriptors[pDescList->ui32Read].Desc.ui32CtrlStatus & DES0_RX_STAT_LAST_DESC) {
                /* Yes - does the frame contain errors? */
                if (pDescList->pDescriptors[pDescList->ui32Read].Desc.ui32CtrlStatus & DES0_RX_STAT_ERR) {
                    /* This is a bad frame so discard it and update the relevant
                   * statistics.
                   */
                    LWIP_DEBUGF(NETIF_DEBUG, ("tivaif_receive: packet error\n"));
                    pbuf_free(pBuf);
                    LINK_STATS_INC(link.drop);
                    DRIVER_STATS_INC(RXPacketErrCount);
                    pBuf = NULL;
                } else {
                    /* This is a good frame so pass it up the stack. */
                    LINK_STATS_INC(link.recv);
                    DRIVER_STATS_INC(RXPacketReadCount);

#if LWIP_PTPD
                    /* Place the timestamp in the PBUF if PTPD is enabled */
                    pBuf->time_s  = pDescList->pDescriptors[pDescList->ui32Read].Desc.ui32IEEE1588TimeHi;
                    pBuf->time_ns = pDescList->pDescriptors[pDescList->ui32Read].Desc.ui32IEEE1588TimeLo;
#endif

