CFXS/CFXS-Motion-Controller/CFXS_Motion_Controller/src/lwip/tiva-tm4c129.cpp
#if NO_SYS
                    //NAFTDO: Calculate network speed IN - THIS HASS BEEN MODIFIED BY KRISTS
                    IncrementNetworkInRate(pBuf->tot_len);
                    if (ethernet_input(pBuf, psNetif) != ERR_OK)
#else
                    if (tcpip_input(pBuf, psNetif) != ERR_OK)
#endif
                    {
                        /* drop the packet */
                        LWIP_DEBUGF(NETIF_DEBUG, ("tivaif_input: input error\n"));
                        pbuf_free(pBuf);

                        /* Adjust the link statistics */
                        LINK_STATS_INC(link.memerr);
                        LINK_STATS_INC(link.drop);
                        DRIVER_STATS_INC(RXPacketCBErrCount);
                    }

                    /* We're finished with this packet so make sure we don't try
                   * to link the next buffer to it.
                   */
                    pBuf = NULL;
                }
            }
        }

        /* Allocate a new buffer for this descriptor */
        pDescList->pDescriptors[pDescList->ui32Read].pBuf           = pbuf_alloc(PBUF_RAW, PBUF_POOL_BUFSIZE, PBUF_POOL);
        pDescList->pDescriptors[pDescList->ui32Read].Desc.ui32Count = DES1_RX_CTRL_CHAINED;
        if (pDescList->pDescriptors[pDescList->ui32Read].pBuf) {
            /* We got a buffer so fill in the payload pointer and size. */
            pDescList->pDescriptors[pDescList->ui32Read].Desc.pvBuffer1 = pDescList->pDescriptors[pDescList->ui32Read].pBuf->payload;
            pDescList->pDescriptors[pDescList->ui32Read].Desc.ui32Count |=
                (pDescList->pDescriptors[pDescList->ui32Read].pBuf->len << DES1_RX_CTRL_BUFF1_SIZE_S);

            /* Give this descriptor back to the hardware */
            pDescList->pDescriptors[pDescList->ui32Read].Desc.ui32CtrlStatus = DES0_RX_CTRL_OWN;
        } else {
            LWIP_DEBUGF(NETIF_DEBUG, ("tivaif_receive: pbuf_alloc error\n"));

            pDescList->pDescriptors[pDescList->ui32Read].Desc.pvBuffer1 = 0;

            /* Update the stats to show we coui32dn't allocate a pbuf. */
            DRIVER_STATS_INC(RXNoBufCount);
            LINK_STATS_INC(link.memerr);

            /* Stop parsing here since we can't leave a broken descriptor in
           * the chain.
           */
            break;
        }

        /* Move on to the next descriptor in the chain, taking care to wrap. */
        pDescList->ui32Read++;
        if (pDescList->ui32Read == pDescList->ui32NumDescs) {
            pDescList->ui32Read = 0;
        }
    }
}

/**
 * should be called at the beginning of the program to set up the
 * network interface. It calls the function tivaif_hwinit() to do the
 * actual setup of the hardware.
 *
 * This function should be passed as a parameter to netif_add().
 *
 * @param psNetif the lwip network interface structure for this ethernetif
 * @return ERR_OK if the loopif is initialized
 *         ERR_MEM if private data coui32dn't be allocated
 *         any other err_t on error
 */
err_t tivaif_init(struct netif *psNetif) {
    LWIP_ASSERT("psNetif != NULL", psNetif != NULL);

#if LWIP_NETIF_HOSTNAME
    /* Initialize interface hostname */
    psNetif->hostname = "lwip";
#endif /* LWIP_NETIF_HOSTNAME */

    /*
   * Initialize the snmp variables and counters inside the struct netif.
   * The last argument should be replaced with your link speed, in units
   * of bits per second.
   */
    NETIF_INIT_SNMP(psNetif, snmp_ifType_ethernet_csmacd, 1000000);

    psNetif->state   = &g_StellarisIFData;
    psNetif->name[0] = IFNAME0;
    psNetif->name[1] = IFNAME1;
    /* We directly use etharp_output() here to save a function call.
   * You can instead declare your own function an call etharp_output()
   * from it if you have to do some checks before sending (e.g. if link
   * is available...) */
    psNetif->output     = etharp_output;
    psNetif->linkoutput = tivaif_transmit;

    /* Remember our MAC address. */
    g_StellarisIFData.ethaddr = (struct eth_addr *)&(psNetif->hwaddr[0]);

    /* Initialize the hardware */
    tivaif_hwinit(psNetif);

    return ERR_OK;
}

/**
 * Process interrupts from the PHY.
 *
 * should be called from the Stellaris Ethernet Interrupt Handler.  This
 * function will read packets from the Stellaris Ethernet fifo and place them
 * into a pbuf queue.  If the transmitter is idle and there is at least one packet
 * on the transmit queue, it will place it in the transmit fifo and start the
 * transmitter.
 *
 */
void tivaif_process_phy_interrupt(struct netif *psNetif) {
    uint16_t ui16Val, ui16Status;
#if EEE_SUPPORT
    uint16_t ui16EEEStatus;
#endif
    uint32_t ui32Config, ui32Mode, ui32RxMaxFrameSize;

    /* Read the PHY interrupt status.  This clears all interrupt sources.
     * Note that we are only enabling sources in EPHY_MISR1 so we don't
     * read EPHY_MISR2.
     */
    ui16Val = EMACPHYRead(EMAC0_BASE, PHY_PHYS_ADDR, EPHY_MISR1);

    EMACPHYRead(EMAC0_BASE, PHY_PHYS_ADDR, EPHY_BMSR); //NAFTDO: Needed to set link status bit in phy register??? - KRISTS
    /* Read the current PHY status. */
    ui16Status = EMACPHYRead(EMAC0_BASE, PHY_PHYS_ADDR, EPHY_STS);

    /* If EEE mode support is requested then read the value of the Link
     * partners status
     */
#if EEE_SUPPORT
    ui16EEEStatus = EMACPHYMMDRead(EMAC0_BASE, PHY_PHYS_ADDR, 0x703D);
#endif

    /* Has the link status changed? */
    if (ui16Val & EPHY_MISR1_LINKSTAT) {
        /* Is link up or down now? */
        if (ui16Status & EPHY_STS_LINK) {
            /* Tell lwIP the link is up. */
#if NO_SYS
            netif_set_link_up(psNetif);
#else
            tcpip_callback((tcpip_callback_fn)netif_set_link_up, psNetif);
#endif

            /* if the link has been advertised as EEE capable then configure
             * the MAC register for LPI timers and manually set the PHY link
             * status bit
             */
#if EEE_SUPPORT
            if (ui16EEEStatus & 0x2) {
                EMACLPIConfig(EMAC0_BASE, true, 1000, 36);
                EMACLPILinkSet(EMAC0_BASE);
                g_bEEELinkActive = true;
            }
#endif

            /* In this case we drop through since we may need to reconfigure
             * the MAC depending upon the speed and half/fui32l-duplex settings.
             */
        } else {
            /* Tell lwIP the link is down */
#if NO_SYS
            netif_set_link_down(psNetif);
#else
            tcpip_callback((tcpip_callback_fn)netif_set_link_down, psNetif);
#endif

            /* if the link has been advertised as EEE capable then clear the
             * MAC register LPI timers and manually clear the PHY link status
             * bit
             */
#if EEE_SUPPORT
            g_bEEELinkActive = false;
            EMACLPILinkClear(EMAC0_BASE);
            EMACLPIConfig(EMAC0_BASE, false, 1000, 0);
#endif
        }
    }

    /* Has the speed or duplex status changed? */
    if (ui16Val & (EPHY_MISR1_SPEED | EPHY_MISR1_SPEED | EPHY_MISR1_ANC)) {
        /* Get the current MAC configuration. */
        EMACConfigGet(EMAC0_BASE, &ui32Config, &ui32Mode, &ui32RxMaxFrameSize);

