CFXS/CFXS-Motion-Controller/CFXS_Motion_Controller/src/lwip/tiva-tm4c129.cpp
        /* What speed is the interface running at now?
         */
        if (ui16Status & EPHY_STS_SPEED) {
            /* 10Mbps is selected */
            ui32Config &= ~EMAC_CONFIG_100MBPS;
        } else {
            /* 100Mbps is selected */
            ui32Config |= EMAC_CONFIG_100MBPS;
        }

        /* Are we in fui32l- or half-duplex mode? */
        if (ui16Status & EPHY_STS_DUPLEX) {
            /* Fui32l duplex. */
            ui32Config |= EMAC_CONFIG_FULL_DUPLEX;
        } else {
            /* Half duplex. */
            ui32Config &= ~EMAC_CONFIG_FULL_DUPLEX;
        }

        /* Reconfigure the MAC */
        EMACConfigSet(EMAC0_BASE, ui32Config, ui32Mode, ui32RxMaxFrameSize);
    }
}

/**
 * Process tx and rx packets at the low-level interrupt.
 *
 * should be called from the Stellaris Ethernet Interrupt Handler.  This
 * function will read packets from the Stellaris Ethernet fifo and place them
 * into a pbuf queue.  If the transmitter is idle and there is at least one packet
 * on the transmit queue, it will place it in the transmit fifo and start the
 * transmitter.
 *
 */
void tivaif_interrupt(struct netif *psNetif, uint32_t ui32Status) {
    tStellarisIF *tivaif;

    /* setup pointer to the if state data */
    tivaif = (tStellarisIF *)psNetif->state;

    /* Update our debug interrupt counters. */
    if (ui32Status & EMAC_INT_NORMAL_INT) {
        g_ui32NormalInts++;
    }

    if (ui32Status & EMAC_INT_ABNORMAL_INT) {
        g_ui32AbnormalInts++;
    }

    /* Is this an interrupt from the PHY? */
    if (ui32Status & EMAC_INT_PHY) {
        tivaif_process_phy_interrupt(psNetif);
    }

    /* Process the transmit DMA list, freeing any buffers that have been
   * transmitted since our last interrupt.
   */
    if (ui32Status & EMAC_INT_TRANSMIT) {
#if EEE_SUPPORT
        if (g_bEEELinkActive) {
            EMACLPIEnter(EMAC0_BASE);
        }
#endif
        tivaif_process_transmit(tivaif);
    }

    /**
   * Process the receive DMA list and pass all successfully received packets
   * up the stack.  We also call this function in cases where the receiver has
   * stalled due to missing buffers since the receive function will attempt to
   * allocate new pbufs for descriptor entries which have none.
   */
    if (ui32Status & EMAC_INT_RX_NO_BUFFER) {
        s_RXOverflow = true;
    }

    if (ui32Status & (EMAC_INT_RECEIVE | EMAC_INT_RX_NO_BUFFER | EMAC_INT_RX_STOPPED)) {
        tivaif_receive(psNetif);
        s_ReceiveInterruptStatus |= ui32Status & (EMAC_INT_RECEIVE | EMAC_INT_RX_NO_BUFFER | EMAC_INT_RX_STOPPED);
    }
}

__weak void EthDMARXOverflow() {
}

void receive_poll(struct netif *netif) {
    SYS_ARCH_DECL_PROTECT(lev);
    SYS_ARCH_PROTECT(lev);

    if (s_RXOverflow) {
        EthDMARXOverflow();
        s_RXOverflow = false;
    }

    if (s_ReceiveInterruptStatus & (EMAC_INT_RECEIVE | EMAC_INT_RX_NO_BUFFER | EMAC_INT_RX_STOPPED)) {
        s_ReceiveInterruptStatus = 0;
        SYS_ARCH_UNPROTECT(lev);
        tivaif_receive(netif);
    } else {
        SYS_ARCH_UNPROTECT(lev);
    }
}

#if NETIF_DEBUG
/* Print an IP header by using LWIP_DEBUGF
 * @param p an IP packet, p->payload pointing to the IP header
 */
void tivaif_debug_print(struct pbuf *p) {
    struct eth_hdr *ethhdr = (struct eth_hdr *)p->payload;
    u16_t *plen            = (u16_t *)p->payload;

    LWIP_DEBUGF(NETIF_DEBUG, ("ETH header:\n"));
    LWIP_DEBUGF(NETIF_DEBUG, ("Packet Length:%5" U16_F " \n", *plen));
    LWIP_DEBUGF(NETIF_DEBUG,
                ("Destination: %02" X8_F "-%02" X8_F "-%02" X8_F "-%02" X8_F "-%02" X8_F "-%02" X8_F "\n",
                 ethhdr->dest.addr[0],
                 ethhdr->dest.addr[1],
                 ethhdr->dest.addr[2],
                 ethhdr->dest.addr[3],
                 ethhdr->dest.addr[4],
                 ethhdr->dest.addr[5]));
    LWIP_DEBUGF(NETIF_DEBUG,
                ("Source: %02" X8_F "-%02" X8_F "-%02" X8_F "-%02" X8_F "-%02" X8_F "-%02" X8_F "\n",
                 ethhdr->src.addr[0],
                 ethhdr->src.addr[1],
                 ethhdr->src.addr[2],
                 ethhdr->src.addr[3],
                 ethhdr->src.addr[4],
                 ethhdr->src.addr[5]));
    LWIP_DEBUGF(NETIF_DEBUG, ("Packet Type:0x%04" U16_F " \n", ethhdr->type));
}
#endif /* NETIF_DEBUG */
